/*
  Province-City-Country selection
  pccs.js
  2007-5-21 17:44
*/

if (typeof $ == "undefined") {
  var $ = function(id) {
    return document.getElementById(id);
  }
}

function PCCS(name, selectionIds, firstOptions, defaultValues) {
 
  this.name = name;
  this.selectionIds = selectionIds;
  this.firstOptions = firstOptions;
  this.defaultValues = defaultValues;

  this.items = {};
}

PCCS.prototype.add = function(id, iArray){
  this.items[id] = iArray;
}

PCCS.prototype.exists = function(id){
  if(typeof this.items[id] == "undefined"){
    return false;
  }
  return true;
}

PCCS.prototype.changeTrigger = function(sltOrdid) {
  var itemKey = "0";
  for(var i=0; i<sltOrdid; i++){
  itemKey += ("_"+($(this.selectionIds[i]).selectedIndex-1));
  }
  var el = $(this.selectionIds[sltOrdid]);
 
  with(el){
    var length = 0;
 var index = 0;
    options[0] = new Option(this.firstOptions[sltOrdid], '');
    if (sltOrdid && $(this.selectionIds[sltOrdid-1]).selectedIndex>0 || !sltOrdid) {
      if (this.exists(itemKey)) {
        var ar = this.items[itemKey];
        for(var i=0; i < ar.length; i++){     
          if (this.defaultValues[sltOrdid] == ar[i]) {
            index = i+1;
          }
          options[length] = new Option(ar[i], ar[i]);
        }
  selectedIndex = index;
      }
    }
    if (++sltOrdid < this.selectionIds.length) {
      this.changeTrigger(sltOrdid);
    }
  }
}

PCCS.prototype.setup = function() {
  var slts = this.selectionIds;
  var instanceName = this.name;
  for(var i=0; i<slts.length-1; i++) {
    $(slts[i]).onchange = new Function(instanceName+".changeTrigger("+(i+1)+")");
  }
  try{
  this.changeTrigger(0);
  }catch(e){
    alert(e.description);
  }
}

PCCS.prototype.init = function() {

this.add("0",["安徽","北京","福建","甘肃","广东","广西","贵州","海南","河北","河南","黑龙江","湖北","湖南","吉林","江苏","江西","辽宁","内蒙古","宁夏","青海","山东","山西","陕西","上海","四川","天津","西藏","新疆","云南","浙江","重庆"]);
this.add("0_0",["滁州","合肥","蚌埠","芜湖","淮南","马鞍山","安庆","宿州","亳州","阜阳","黄山","淮北","铜陵","宣城","六安","巢湖","池州"]);
this.add("0_0_0",["滁州","定远县","凤阳县","来安县","琅琊区","明光市","南谯区","全椒县","天长市"]);
this.add("0_0_1",["合肥","长丰县","肥东县","肥西县"]);
this.add("0_0_2",["蚌埠","蚌山区","固镇县","怀远县","淮上区","龙子湖区","五河县","禹会区"]);
this.add("0_0_3",["芜湖","繁昌县","镜湖区","鸠江区","马塘区","南陵县","芜湖县","新芜区"]);
this.add("0_0_4",["淮南","八公山区","大通区","凤台县","潘集区","田家庵区","谢家集区"]);
this.add("0_0_5",["马鞍山","当涂县","花山区","金家庄区","雨山区"]);
this.add("0_0_6",["安庆","枞阳县","大观区","怀宁县","郊区","潜山县","宿松县","太湖县","桐城市","望江县","迎江区","岳西县"]);
this.add("0_0_7",["宿州","砀山县","灵璧县","泗县","萧县","墉桥区"]);
this.add("0_0_8",["亳州","利辛县","蒙城县","谯城区","涡阳县"]);
this.add("0_0_9",["阜阳","阜南县","界首市","临泉县","太和县","颍东区","颍泉区","颍上县","颍州区"]);
this.add("0_0_10",["黄山","黄山区","徽州区","祁门县","屯溪区","歙县","休宁县","黟县"]);
this.add("0_0_11",["淮北","杜集区","烈山区","濉溪县","相山区"]);
this.add("0_0_12",["铜陵","郊区","狮子山区","铜官山区","铜陵县"]);
this.add("0_0_13",["宣城","广德县","绩溪县","泾县","旌德县","郎溪县","宁国市","宣州区"]);
this.add("0_0_14",["六安","霍邱县","霍山县","金安区","金寨县","寿县","舒城县","裕安区"]);
this.add("0_0_15",["巢湖","含山县","和县","居巢区","庐江县","无为县"]);
this.add("0_0_16",["池州","东至县","贵池区","青阳县","石台县"]);
this.add("0_1",["北京"]);
this.add("0_1_0",["北京","昌平区","朝阳区","崇文区","大兴区","东城区","房山区","丰台区","海淀区","怀柔区","门头沟区","密云县","平谷区","石景山区","顺义区","通州区","西城区","宣武区","延庆县"]);
this.add("0_2",["福州","厦门","宁德","莆田","泉州","漳州","龙岩","三明","南平"]);
this.add("0_2_0",["福州","仓山区","长乐市","福清市","鼓楼区","晋安区","连江县","罗源县","马尾区","闽侯县","闽清县","平潭县","台江区","永泰县"]);
this.add("0_2_1",["厦门","海沧区","湖里区","集美区","思明区","同安区","翔安区"]);
this.add("0_2_2",["宁德","福安市","福鼎市","古田县","蕉城区","屏南县","寿宁县","霞浦县","柘荣县","周宁县"]);
this.add("0_2_3",["莆田","城厢区","涵江区","荔城区","仙游县","秀屿区"]);
this.add("0_2_4",["泉州","安溪县","德化县","丰泽区","惠安县","金门县","晋江市","鲤城区","洛江区","南安市","泉港区","石狮市","永春县"]);
this.add("0_2_5",["漳州","长泰县","东山县","华安县","龙海市","龙文区","南靖县","平和县","芗城区","云霄县","漳浦县","诏安县"]);
this.add("0_2_6",["龙岩","长汀县","连城县","上杭县","武平县","新罗区","永定县","漳平市"]);
this.add("0_2_7",["三明","大田县","建宁县","将乐县","梅列区","明溪县","宁化县","清流县","三元区","沙县","泰宁县","永安市","尤溪县"]);
this.add("0_2_8",["南平","光泽县","建瓯市","建阳市","浦城县","邵武市","顺昌县","松溪县","武夷山市","延平区","政和县"]);
this.add("0_3",["临夏回族自治州","兰州","定西","平凉","庆阳","金昌","陇南","武威","张掖","嘉峪关","酒泉","天水","甘南藏族自治州","白银"]);
this.add("0_3_0",["临夏回族自治州","东乡族自治县","广河县","和政县","积石山保安族东乡族撒拉族自治县","康乐县","临夏市","临夏县","永靖县"]);
this.add("0_3_1",["兰州","安宁区","城关区","皋兰县","红古区","七里河区","西固区","永登县","榆中县"]);
this.add("0_3_2",["定西","安定区","临洮县","陇西县","岷县","通渭县","渭源县","漳县"]);
this.add("0_3_3",["平凉","崇信县","华亭县","泾川县","静宁县","崆峒区","灵台县","庄浪县"]);
this.add("0_3_4",["庆阳","合水县","华池县","环县","宁县","庆阳县","西峰区","镇原县","正宁县"]);
this.add("0_3_5",["金昌","金昌市","金川区","永昌县"]);
this.add("0_3_6",["陇南","成县","宕昌县","徽县","康县","礼县","两当县","文县","武都区","西和县"]);
this.add("0_3_7",["武威","古浪县","凉州区","民勤县","天祝藏族自治县"]);
this.add("0_3_8",["张掖","甘州区","高台县","临泽县","民乐县","山丹县","肃南裕固族自治县"]);
this.add("0_3_9",["嘉峪关","嘉峪关市"]);
this.add("0_3_10",["酒泉","阿克塞哈萨克族自治县","安西县","敦煌市","金塔县","肃北蒙古族自治县","肃州区","玉门市"]);
this.add("0_3_11",["天水","甘谷县","麦积区","秦安县","秦州区","清水县","天水市","武山县","张家川回族自治县"]);
this.add("0_3_12",["甘南藏族自治州","迭部县","合作市","临潭县","碌曲县","玛曲县","夏河县","舟曲县","卓尼县"]);
this.add("0_3_13",["白银","白银区","会宁县","景泰县","靖远县","平川区"]);
this.add("0_4",["广州","汕尾","汕头","阳江","揭阳","茂名","江门","韶关","惠州","梅州","汕头","深圳","珠海","佛山","肇庆","湛江","中山","河源","清远","云浮","潮州","东莞"]);
this.add("0_4_0",["广州","白云区","从化市","东山区","番禺区","芳村区","海珠区","花都区","黄埔区","荔湾区","天河区","越秀区","增城市"]);
this.add("0_4_1",["汕尾","城区","海丰县","陆丰市","陆河县"]);
this.add("0_4_2",["汕头","潮南区","潮阳区","澄海区","濠江区","金平区","龙湖区","南澳县"]);
this.add("0_4_3",["阳江","江城区","阳春市","阳东县","阳西县"]);
this.add("0_4_4",["揭阳","惠来县","揭东县","揭西县","普宁市","榕城区"]);
this.add("0_4_5",["茂名","电白县","高州市","化州市","茂港区","茂南区","信宜市"]);
this.add("0_4_6",["江门","恩平市","鹤山市","江海区","开平市","蓬江区","台山市","新会区"]);
this.add("0_4_7",["韶关","乐昌市","南雄市","曲江区","仁化县","乳源瑶族自治县","始兴县","翁源县","武江区","新丰县","浈江区"]);
this.add("0_4_8",["惠州","博罗县","惠城区","惠东县","惠阳区","龙门县"]);
this.add("0_4_9",["梅州","大埔县","丰顺县","蕉岭县","梅江区","梅县","平远县","五华县","兴宁市"]);
this.add("0_4_10",["汕头","潮南区","潮阳区","澄海区","濠江区","金平区","龙湖区","南澳县"]);
this.add("0_4_11",["深圳","宝安区","福田区","龙岗区","罗湖区","南山区","盐田区"]);
this.add("0_4_12",["珠海","斗门区","金湾区","香洲区"]);
this.add("0_4_13",["佛山","禅城区","高明区","南海区","三水区","顺德区"]);
this.add("0_4_14",["肇庆","德庆县","鼎湖区","端州区","封开县","高要市","广宁县","怀集县","四会市"]);
this.add("0_4_15",["湛江","赤坎区","雷州市","廉江市","麻章区","坡头区","遂溪县","吴川市","霞山区","徐闻县"]);
this.add("0_4_16",["中山","中山市"]);
this.add("0_4_17",["河源","东源县","和平县","连平县","龙川县","源城区","紫金县"]);
this.add("0_4_18",["清远","佛冈县","连南瑶族自治县","连山壮族瑶族自治县","连州市","清城区","清新县","阳山县","英德市"]);
this.add("0_4_19",["云浮","罗定市","新兴县","郁南县","云安县","云城区"]);
this.add("0_4_20",["潮州","潮安县","饶平县","湘桥区"]);
this.add("0_4_21",["东莞","东莞市"]);
this.add("0_5",["贺州","防城港","崇左","南宁","来宾","柳州","桂林","梧州","贵港","玉林","百色","钦州","河池","北海"]);
this.add("0_5_0",["贺州","八步区","富川瑶族自治县","昭平县","钟山县"]);
this.add("0_5_1",["防城港","东兴市","防城区","港口区","上思县"]);
this.add("0_5_2",["崇左","大新县","扶绥县","江洲区","龙州县","宁明县","凭祥市","天等县"]);
this.add("0_5_3",["南宁","宾阳县","横县","江南区","良庆区","隆安县","马山县","青秀区","上林县","武鸣县","西乡塘区","兴宁区","邕宁区"]);
this.add("0_5_4",["来宾","合山市","金秀瑶族自治县","武宣县","象州县","忻城县","兴宾区"]);
this.add("0_5_5",["柳州","城中区","柳北区","柳城县","柳江县","柳南区","鹿寨县","融安县","融水苗族自治县","三江侗族自治县","鱼峰区"]);
this.add("0_5_6",["桂林","叠彩区","恭城瑶族自治县","灌阳县","荔蒲县","临桂县","灵川县","龙胜各族自治县","平乐县","七星区","全州县","象山区","兴安县","秀峰区","雁山区","阳朔县","永福县","资源县"]);
this.add("0_5_7",["梧州","苍梧县","岑溪市","长洲区","蝶山区","蒙山县","藤县","万秀区"]);
this.add("0_5_8",["贵港","港北区","港南区","桂平市","平南县","覃塘区"]);
this.add("0_5_9",["玉林","北流市","博白县","陆川县","容县","兴业县","玉州区"]);
this.add("0_5_10",["百色","德保县","靖西县","乐业县","凌云县","隆林各族自治县","那坡县","平果县","田东县","田林县","田阳县","西林县","右江区"]);
this.add("0_5_11",["钦州","灵山县","浦北县","钦北区","钦南区"]);
this.add("0_5_12",["河池","巴马瑶族自治县","大化瑶族自治县","东兰县","都安瑶族自治县","凤山县","环江毛南族自治县","金城江区","罗城仫佬族自治县","南丹县","天峨县","宜州市"]);
this.add("0_5_13",["北海","海城区","合浦县","铁山港区","银海区"]);
this.add("0_6",["贵阳","遵义","安顺","黔南布依族苗族自治州","黔东南苗族侗族自治州","铜仁地区","毕节地区","六盘水","黔西南布依族苗族自治州"]);
this.add("0_6_0",["贵阳","白云区","花溪区","开阳县","南明区","清镇市","乌当区","息烽县","小河区","修文县","云岩区"]);
this.add("0_6_1",["遵义","赤水市","道真仡佬族苗族自治县","凤冈县","红花岗区","汇川区","湄潭县","仁怀市","绥阳县","桐梓县","务川仡佬族苗族自治县","习水县","余庆县","正安县","遵义县"]);
this.add("0_6_2",["安顺","关岭布依族苗族自治县","平坝县","普定县","西秀区","镇宁布依族苗族自治县","紫云苗族布依族自治县"]);
this.add("0_6_3",["黔南布依族苗族自治州","长顺县","都匀市","独山县","福泉市","贵定县","惠水县","荔波县","龙里县","罗甸县","平塘县","三都水族自治县","瓮安县"]);
this.add("0_6_4",["黔东南苗族侗族自治州","岑巩县","从江县","丹寨县","黄平县","剑河县","锦屏县","凯里市","雷山县","黎平县","麻江县","榕江县","三穗县","施秉县","台江县","天柱县","镇远县"]);
this.add("0_6_5",["铜仁地区","德江县","江口县","石阡县","思南县","松桃苗族自治县","铜仁市","万山特区","沿河土家族自治县","印江土家族苗族自治县","玉屏侗族自治县"]);
this.add("0_6_6",["毕节地区","毕节市","大方县","赫章县","金沙县","纳雍县","黔西县","威宁彝族回族苗族自治县","织金县"]);
this.add("0_6_7",["六盘水","六枝特区","盘县","水城县","钟山区"]);
this.add("0_6_8",["黔西南布依族苗族自治州","安龙县","册亨县","普安县","晴隆县","望谟县","兴仁县","兴义市","贞丰县"]);
this.add("0_7",["海南","三亚"]);
this.add("0_7_0",["海南","龙华区","美兰区","琼山区","秀英区"]);
this.add("0_7_1",["三亚","白沙黎族自治县","保亭黎族苗族自治县","昌江黎族自治县","澄迈县","儋州市","定安县","东方市","乐东黎族自治县","临高县","陵水黎族自治县","南沙群岛","琼海市","琼中黎族苗族自治县","屯昌县","万宁市","文昌市","五指山市","西沙群岛","中沙群岛的岛礁及其海域"]);
this.add("0_8",["邯郸","石家庄","保定","张家口","承德","唐山","廊坊","沧州","衡水","邢台","秦皇岛"]);
this.add("0_8_0",["邯郸","成安县","磁县","丛台区","大名县","肥乡县","峰峰矿区","复兴区","馆陶县","广平县","邯郸县","邯山区","鸡泽县","临漳县","邱县","曲周县","涉县","魏县","武安市","永年县"]);
this.add("0_8_1",["石家庄","长安区","高邑县","藁城市","晋州市","井陉矿区","井陉县","灵寿县","鹿泉市","栾城县","平山县","桥东区","桥西区","深泽县","无极县","辛集市","新华区","新乐市","行唐县","裕华区","元氏县","赞皇县","赵县","正定县"]);
this.add("0_8_2",["保定","安国市","安新县","北市区","博野县","定兴县","定州市","阜平县","高碑店市","高阳县","涞水县","涞源县","蠡县","满城县","南市区","清苑县","曲阳县","容城县","顺平县","唐县","望都县","新市区","雄县","徐水县","易县","涿州市"]);
this.add("0_8_3",["张家口","赤城县","崇礼县","沽源县","怀安县","怀来县","康保县","桥东区","桥西区","尚义县","万全县","蔚县","下花园区","宣化区","宣化县","阳原县","张北县","涿鹿县"]);
this.add("0_8_4",["承德","承德县","丰宁满族自治县","宽城满族自治县","隆化县","滦平县","平泉县","双滦区","双桥区","围场满族蒙古族自治县","兴隆县","鹰手营子矿区"]);
this.add("0_8_5",["唐山","丰南区","丰润区","古冶区","开平区","乐亭县","路北区","路南区","滦南县","滦县","迁安市","迁西县","唐海县","玉田县","遵化市"]);
this.add("0_8_6",["廊坊","安次区","霸州市","大厂回族自治县","大城县","固安县","广阳区","三河市","文安县","香河县","永清县"]);
this.add("0_8_7",["沧州","泊头市","沧县","东光县","海兴县","河间市","黄骅市","孟村回族自治县","南皮县","青县","任丘市","肃宁县","吴桥县","献县","新华区","盐山县","运河区"]);
this.add("0_8_8",["衡水","安平县","阜城县","故城县","冀州市","景县","饶阳县","深州市","桃城区","武强县","武邑县","枣强县"]);
this.add("0_8_9",["邢台","柏乡县","广宗县","巨鹿县","临城县","临西县","隆尧县","内丘县","南宫市","南和县","宁晋县","平乡县","桥东区","桥西区","清河县","任县","沙河市","威县","新河县","邢台县"]);
this.add("0_8_10",["秦皇岛","北戴河区","昌黎县","抚宁县","海港区","卢龙县","青龙满族自治县","山海关区"]);
this.add("0_9",["商丘","郑州","安阳","新乡","许昌","平顶山","信阳","南阳","开封","洛阳","焦作","鹤壁","濮阳","周口","漯河","驻马店","信阳","三门峡"]);
this.add("0_9_0",["商丘","梁园区","民权县","宁陵县","睢县","睢阳区","夏邑县","永城市","虞城县","柘城县"]);
this.add("0_9_1",["郑州","登封市","二七区","巩义市","管城回族区","金水区","邙山区","上街区","新密市","新郑市","荥阳市","中牟县","中原区"]);
this.add("0_9_2",["安阳","安阳县","北关区","滑县","林州市","龙安区","内黄县","汤阴县","文峰区","殷都区"]);
this.add("0_9_3",["新乡","长垣县","封丘县","红旗区","辉县市","获嘉县","卫辉市","新乡县","延津县","原阳县"]);
this.add("0_9_4",["许昌","长葛市","魏都区","襄城县","许昌县","鄢陵县","禹州市"]);
this.add("0_9_5",["平顶山","宝丰县","郏县","鲁山县","汝州市","石龙区","卫东区","舞钢市","新华区","叶县","湛河区"]);
this.add("0_9_6",["信阳","固始县","光山县","淮滨县","潢川县","罗山县","平桥区","商城县","师河区","息县","新县"]);
this.add("0_9_7",["南阳","邓州市","方城县","内乡县","南召县","社旗县","唐河县","桐柏县","宛城区","卧龙区","西峡县","淅川县","新野县","镇平县"]);
this.add("0_9_8",["开封","鼓楼区","郊区","开封县","兰考县","龙亭区","南关区","杞县","顺河回族区","通许县","尉氏县"]);
this.add("0_9_9",["洛阳","廛河回族区","吉利区","涧西区","老城区","栾川县","洛龙区","洛宁县","孟津县","汝阳县","嵩县","西工区","新安县","偃师市","伊川县","宜阳县"]);
this.add("0_9_10",["焦作","博爱县","济源市","解放区","马村区","孟州市","沁阳市","山阳区","温县","武陟县","修武县","中站区"]);
this.add("0_9_11",["鹤壁","鹤山区","浚县","淇滨区","淇县","山城区"]);
this.add("0_9_12",["濮阳","范县","南乐县","濮阳县","清丰县","台前县"]);
this.add("0_9_13",["周口","川汇区","郸城县","扶沟县","淮阳县","鹿邑县","商水县","沈丘县","太康县","西华县","项城市"]);
this.add("0_9_14",["漯河","临颍县","舞阳县","郾城区","源汇区","召陵区"]);
this.add("0_9_15",["驻马店","泌阳县","平舆县","确山县","汝南县","上蔡县","遂平县","西平县","新蔡县","驿城区","正阳县"]);
this.add("0_9_16",["信阳","固始县","光山县","淮滨县","潢川县","罗山县","平桥区","商城县","师河区","息县","新县"]);
this.add("0_9_17",["三门峡","湖滨区","灵宝市","卢氏县","陕县","渑池县","义马市"]);
this.add("0_10",["哈尔滨","齐齐哈尔","牡丹江","佳木斯","绥化","黑河","大兴安岭地区","伊春","大庆","七台河","鸡西","鹤岗","双鸭山"]);
this.add("0_10_0",["哈尔滨","阿城市","巴彦县","宾县","道里区","道外区","动力区","方正县","呼兰区","木兰县","南岗区","平房区","尚志市","双城市","松北区","通河县","五常市","香坊区","延寿县","依兰县"]);
this.add("0_10_1",["齐齐哈尔","昂昂溪区","拜泉县","富拉尔基区","富裕县","甘南县","建华区","克东县","克山县","龙江县","龙沙区","梅里斯达斡尔族区","讷河市","碾子山区","泰来县","铁锋区","依安县"]);
this.add("0_10_2",["牡丹江","爱民区","东安区","东宁县","海林市","林口县","穆棱市","宁安市","绥芬河市","西安区","阳明区"]);
this.add("0_10_3",["佳木斯","东风区","抚远县","富锦市","桦川县","桦南县","郊区","前进区","汤原县","同江市","向阳区","永红区"]);
this.add("0_10_4",["绥化","安达市","北林区","海伦市","兰西县","明水县","青冈县","庆安县","绥棱县","望奎县","肇东市"]);
this.add("0_10_5",["黑河","爱辉区","北安市","嫩江县","孙吴县","五大连池市","逊克县"]);
this.add("0_10_6",["大兴安岭地区","呼玛县","漠河县","塔河县"]);
this.add("0_10_7",["伊春","翠峦区","带岭区","红星区","嘉荫县","金山屯区","美溪区","南岔区","上甘岭区","汤旺河区","铁力市","乌马河区","乌伊岭区","五营区","西林区","新青区","伊春区","友好区"]);
this.add("0_10_8",["大庆","大同区","杜尔伯特蒙古族自治县","红岗区","林甸县","龙凤区","让胡路区","萨尔图区","肇源县","肇州县"]);
this.add("0_10_9",["七台河","勃利县","茄子河区","桃山区","新兴区"]);
this.add("0_10_10",["鸡西","城子河区","滴道区","恒山区","虎林市","鸡东县","鸡冠区","梨树区","麻山区","密山市"]);
this.add("0_10_11",["鹤岗","东山区","工农区","萝北县","南山区","绥滨县","向阳区","兴安区","兴山区"]);
this.add("0_10_12",["双鸭山","宝清县","宝山区","集贤县","尖山区","岭东区","饶河县","四方台区","友谊县"]);
this.add("0_11",["武汉","襄樊","鄂州","孝感","黄冈","黄石","咸宁","荆州","宜昌","恩施土家族苗族自治州","省直辖行政单位","十堰","随州","荆门","省直辖行政单位"]);
this.add("0_11_0",["武汉","蔡甸区","东西湖区","汉南区","汉阳区","洪山区","黄陂区","江岸区","江汉区","江夏区","乔口区","青山区","武昌区","新洲区"]);
this.add("0_11_1",["襄樊","保康县","樊城区","谷城县","老河口市","南漳县","襄城区","襄阳区","宜城市","枣阳市"]);
this.add("0_11_2",["鄂州","鄂城区","华容区","梁子湖区"]);
this.add("0_11_3",["孝感","安陆市","大悟县","汉川市","孝昌县","孝南区","应城市","云梦县"]);
this.add("0_11_4",["黄冈","红安县","黄梅县","黄州区","罗田县","麻城市","蕲春县","团风县","武穴市","浠水县","英山县"]);
this.add("0_11_5",["黄石","大冶市","黄石港区","铁山区","下陆区","阳新县"]);
this.add("0_11_6",["咸宁","赤壁市","崇阳县","嘉鱼县","通城县","通山县","咸安区"]);
this.add("0_11_7",["荆州","公安县","洪湖市","监利县","江陵县","荆州区","沙市区","石首市","松滋市"]);
this.add("0_11_8",["宜昌","长阳土家族自治县","当阳市","点军区","虎亭区","五峰土家族自治县","伍家岗区","西陵区","兴山县","夷陵区","宜都市","远安县","枝江市","秭归县"]);
this.add("0_11_9",["恩施土家族苗族自治州","巴东县","恩施市","鹤峰县","建始县","来凤县","利川市","咸丰县","宣恩县"]);
this.add("0_11_10",["省直辖行政单位","阿拉尔市","潜江市","神农架林区","石河子市","天门市","图木舒克市","五家渠市","仙桃市"]);
this.add("0_11_11",["十堰","丹江口市","房县","茅箭区","郧西县","郧县","张湾区","竹山县","竹溪县"]);
this.add("0_11_12",["随州","广水市","曾都区"]);
this.add("0_11_13",["荆门","东宝区","掇刀区","京山县","沙洋县","钟祥市"]);
this.add("0_11_14",["省直辖行政单位","阿拉尔市","潜江市","神农架林区","石河子市","天门市","图木舒克市","五家渠市","仙桃市"]);
this.add("0_12",["岳阳","长沙","湘潭","株洲","衡阳","郴州","常德","益阳","娄底","邵阳","湘西土家族苗族自治州","张家界","怀化","永州"]);
this.add("0_12_0",["岳阳","华容县","君山区","临湘市","汨罗市","平江县","湘阴县","岳阳楼区","岳阳县","云溪区"]);
this.add("0_12_1",["长沙","长沙县","芙蓉区","开福区","浏阳市","宁乡县","天心区","望城县","雨花区","岳麓区"]);
this.add("0_12_2",["湘潭","韶山市","湘潭县","湘乡市","雨湖区","岳塘区"]);
this.add("0_12_3",["株洲","茶陵县","荷塘区","醴陵市","芦淞区","石峰区","天元区","炎陵县","攸县","株洲县"]);
this.add("0_12_4",["衡阳","常宁市","衡东县","衡南县","衡山县","衡阳县","耒阳市","南岳区","祁东县","石鼓区","雁峰区","蒸湘区","珠晖区"]);
this.add("0_12_5",["郴州","安仁县","北湖区","桂东县","桂阳县","嘉禾县","临武县","汝城县","苏仙区","宜章县","永兴县","资兴市"]);
this.add("0_12_6",["常德","安乡县","鼎城区","汉寿县","津市市","澧县","临澧县","石门县","桃源县","武陵区"]);
this.add("0_12_7",["益阳","安化县","赫山区","南县","桃江县","沅江市","资阳区"]);
this.add("0_12_8",["娄底","冷水江市","涟源市","娄星区","双峰县","新化县"]);
this.add("0_12_9",["邵阳","北塔区","城步苗族自治县","大祥区","洞口县","隆回县","邵东县","邵阳县","双清区","绥宁县","武冈市","新宁县","新邵县"]);
this.add("0_12_10",["湘西土家族苗族自治州","保靖县","凤凰县","古丈县","花垣县","吉首市","龙山县","泸溪县","永顺县"]);
this.add("0_12_11",["张家界","慈利县","桑植县","武陵源区","永定区"]);
this.add("0_12_12",["怀化","辰溪县","鹤城区","洪江市","会同县","靖州苗族侗族自治县","麻阳苗族自治县","通道侗族自治县","新晃侗族自治县","溆浦县","沅陵县","芷江侗族自治县","中方县"]);
this.add("0_12_13",["永州","道县","东安县","江华瑶族自治县","江永县","蓝山县","冷水滩区","宁远县","祁阳县","双牌县","新田县","芝山区"]);
this.add("0_13",["长春","吉林","延边朝鲜族自治州","四平","通化","白城","辽源","松原","白山","延边朝鲜族自治州","通化"]);
this.add("0_13_0",["长春","朝阳区","德惠市","二道区","九台市","宽城区","绿园区","南关区","农安县","双阳区","榆树市"]);
this.add("0_13_1",["吉林","昌邑区","船营区","丰满区","桦甸市","蛟河市","龙潭区","磐石市","舒兰市","永吉县"]);
this.add("0_13_2",["延边朝鲜族自治州","安图县","敦化市","和龙市","珲春市","龙井市","图们市","汪清县","延吉市"]);
this.add("0_13_3",["四平","公主岭市","梨树县","双辽市","铁东区","铁西区","伊通满族自治县"]);
this.add("0_13_4",["通化","东昌区","二道江区","辉南县","集安市","柳河县","梅河口市","通化县"]);
this.add("0_13_5",["白城","大安市","洮北区","洮南市","通榆县","镇赉县"]);
this.add("0_13_6",["辽源","东丰县","东辽县","龙山区","西安区"]);
this.add("0_13_7",["松原","长岭县","扶余县","宁江区","前郭尔罗斯蒙古族自治县","乾安县"]);
this.add("0_13_8",["白山","八道江区","长白朝鲜族自治县","抚松县","江源县","靖宇县","临江市"]);
this.add("0_13_9",["延边朝鲜族自治州","安图县","敦化市","和龙市","珲春市","龙井市","图们市","汪清县","延吉市"]);
this.add("0_13_10",["通化","东昌区","二道江区","辉南县","集安市","柳河县","梅河口市","通化县"]);
this.add("0_14",["南京","无锡","镇江","苏州","南通","扬州","盐城","徐州","淮安","连云港","常州","泰州","宿迁"]);
this.add("0_14_0",["南京","白下区","高淳县","鼓楼区","建邺区","江宁区","溧水县","六合区","浦口区","栖霞区","秦淮区","下关区","玄武区","雨花台区"]);
this.add("0_14_1",["无锡","北塘区","崇安区","惠山区","江阴市","南长区","锡山区","宜兴市"]);
this.add("0_14_2",["镇江","丹徒区","丹阳市","京口区","句容市","润州区","扬中市"]);
this.add("0_14_3",["苏州","沧浪区","常熟市","虎丘区","金阊区","昆山市","平江区","太仓市","吴江市","吴中区","相城区","张家港市"]);
this.add("0_14_4",["南通","崇川区","港闸区","海安县","海门市","启东市","如东县","如皋市","通州市"]);
this.add("0_14_5",["扬州","宝应县","高邮市","广陵区","邗江区","江都市","仪征市"]);
this.add("0_14_6",["盐城","滨海县","大丰市","东台市","阜宁县","建湖县","射阳县","响水县","盐都区"]);
this.add("0_14_7",["徐州","丰县","鼓楼区","贾汪区","九里区","沛县","邳州市","泉山区","睢宁县","铜山县","新沂市","云龙区"]);
this.add("0_14_8",["淮安","楚州区","洪泽县","淮阴区","金湖县","涟水县","清河区","清浦区","盱眙县"]);
this.add("0_14_9",["连云港","东海县","赣榆县","灌南县","灌云县","海州区","连云区","新浦区"]);
this.add("0_14_10",["常州","金坛市","溧阳市","戚墅堰区","天宁区","武进区","钟楼区"]);
this.add("0_14_11",["泰州","高港区","海陵区","姜堰市","靖江市","泰兴市","兴化市"]);
this.add("0_14_12",["宿迁","沭阳县","泗洪县","泗阳县","宿城区","宿豫区"]);
this.add("0_15",["鹰潭","新余","南昌","九江","上饶","抚州","宜春","吉安","赣州","景德镇","萍乡"]);

this.add("0_15_0",["鹰潭","贵溪市","余江县","月湖区"]);
this.add("0_15_1",["新余","分宜县","渝水区"]);
this.add("0_15_2",["南昌","安义县","东湖区","进贤县","南昌县","青云谱区","湾里区","西湖区","新建县"]);
this.add("0_15_3",["九江","德安县","都昌县","湖口县","九江县","庐山区","彭泽县","瑞昌市","武宁县","星子县","修水县","浔阳区","永修县"]);
this.add("0_15_4",["上饶","德兴市","广丰县","横峰县","鄱阳县","铅山县","上饶县","万年县","婺源县","信州区","弋阳县","余干县","玉山县"]);
this.add("0_15_5",["抚州","崇仁县","东乡县","广昌县","金溪县","乐安县","黎川县","临川区","南城县","南丰县","宜黄县","资溪县"]);
this.add("0_15_6",["宜春","丰城市","奉新县","高安市","靖安县","上高县","铜鼓县","万载县","宜丰县","袁州区","樟树市"]);
this.add("0_15_7",["吉安","安福县","吉安县","吉水县","吉州区","井冈山市","青原区","遂川县","泰和县","万安县","峡江县","新干县","永丰县","永新县"]);
this.add("0_15_8",["赣州","安远县","崇义县","大余县","定南县","赣县","会昌县","龙南县","南康市","宁都县","全南县","瑞金市","上犹县","石城县","信丰县","兴国县","寻乌县","于都县","章贡区"]);
this.add("0_15_9",["景德镇","昌江区","浮梁县","乐平市","珠山区"]);
this.add("0_15_10",["萍乡","安源区","莲花县","芦溪县","上栗县","湘东区"]);
this.add("0_16",["沈阳","铁岭","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","朝阳","盘锦","葫芦岛"]);
this.add("0_16_0",["沈阳","大东区","东陵区","法库县","和平区","皇姑区","康平县","辽中县","沈河区","苏家屯区","铁西区","新城子区","新民市","于洪区"]);
this.add("0_16_1",["铁岭","昌图县","开原市","清河区","铁岭县","西丰县","银州区"]);
this.add("0_16_2",["大连","长海县","甘井子区","金州区","旅顺口区","普兰店市","沙河口区","瓦房店市","西岗区","中山区","庄河市"]);
this.add("0_16_3",["鞍山","海城市","立山区","千山区","台安县","铁东区","铁西区","岫岩满族自治县"]);
this.add("0_16_4",["抚顺","东洲区","抚顺县","清原满族自治县","顺城区","望花区","新宾满族自治县","新抚区"]);
this.add("0_16_5",["本溪","本溪满族自治县","桓仁满族自治县","明山区","南芬区","平山区","溪湖区"]);
this.add("0_16_6",["丹东","东港市","凤城市","宽甸满族自治县","元宝区","振安区","振兴区"]);
this.add("0_16_7",["锦州","北宁市","古塔区","黑山县","凌海市","凌河区","太和区","义县"]);
this.add("0_16_8",["营口","鲅鱼圈区","大石桥市","盖州市","老边区","西市区","站前区"]);
this.add("0_16_9",["阜新","阜新蒙古族自治县","海州区","清河门区","太平区","细河区","新邱区","彰武县"]);
this.add("0_16_10",["辽阳","白塔区","灯塔市","弓长岭区","宏伟区","辽阳县","太子河区","文圣区"]);
this.add("0_16_11",["朝阳","北票市","朝阳县","建平县","喀喇沁左翼蒙古族自治县","凌源市","龙城区","双塔区"]);
this.add("0_16_12",["盘锦","大洼县","盘山县","双台子区","兴隆台区"]);
this.add("0_16_13",["葫芦岛","建昌县","连山区","龙港区","南票区","绥中县","兴城市"]);
this.add("0_17",["呼伦贝尔","呼和浩特","包头","乌海","乌兰察布","通辽","赤峰","鄂尔多斯","巴彦淖尔","锡林郭勒盟","兴安盟","阿拉善盟"]);
this.add("0_17_0",["呼伦贝尔","阿荣旗","陈巴尔虎旗","额尔古纳市","鄂伦春自治旗","鄂温克族自治旗","根河市","海拉尔区","满洲里市","莫力达瓦达斡尔族自治旗","新巴尔虎右旗","新巴尔虎左旗","牙克石市","扎兰屯市"]);
this.add("0_17_1",["呼和浩特","和林格尔县","回民区","清水河县","土默特左旗","托克托县","武川县","新城区","玉泉区"]);
this.add("0_17_2",["包头","白云矿区","达尔罕茂明安联合旗","东河区","固阳县","昆都伦区","青山区","土默特右旗"]);
this.add("0_17_3",["乌海","海勃湾区","海南区","乌达区"]);
this.add("0_17_4",["乌兰察布","察哈尔右翼后旗","察哈尔右翼前旗","察哈尔右翼中旗","丰镇市","化德县","集宁区","凉城县","商都县","四子王旗","兴和县","卓资县"]);
this.add("0_17_5",["通辽","霍林郭勒市","开鲁县","科尔沁区","科尔沁左翼后旗","科尔沁左翼中旗","库伦旗","奈曼旗","扎鲁特旗"]);
this.add("0_17_6",["赤峰","阿鲁科尔沁旗","敖汉旗","巴林右旗","巴林左旗","红山区","喀喇沁旗","克什克腾旗","林西县","宁城县","松山区","翁牛特旗","元宝山区"]);
this.add("0_17_7",["鄂尔多斯","达拉特旗","东胜区","鄂托克旗","鄂托克前旗","杭锦旗","乌审旗","伊金霍洛旗","准格尔旗"]);
this.add("0_17_8",["巴彦淖尔","磴口县","杭锦后旗","临河区","乌拉特后旗","乌拉特前旗","乌拉特中旗","五原县"]);
this.add("0_17_9",["锡林郭勒盟","阿巴嘎旗","东乌珠穆沁旗","多伦县","二连浩特市","苏尼特右旗","苏尼特左旗","太仆寺旗","西乌珠穆沁旗","锡林浩特市","镶黄旗","正蓝旗","正镶白旗"]);
this.add("0_17_10",["兴安盟","阿尔山市","科尔沁右翼前旗","科尔沁右翼中旗","突泉县","乌兰浩特市","扎赉特旗"]);
this.add("0_17_11",["阿拉善盟","阿拉善右旗","阿拉善左旗","额济纳旗"]);
this.add("0_18",["银川","石嘴山","吴忠","中卫","固原","中卫"]);
this.add("0_18_0",["银川","贺兰县","金凤区","灵武市","西夏区","兴庆区","银川市","永宁县"]);
this.add("0_18_1",["石嘴山","大武口区","惠农区","平罗县"]);
this.add("0_18_2",["吴忠","利通区","青铜峡市","同心县","吴忠市","盐池县"]);
this.add("0_18_3",["中卫","海原县","沙坡头区","中宁县"]);
this.add("0_18_4",["固原","泾源县","隆德县","彭阳县","西吉县","原州区"]);
this.add("0_18_5",["中卫","海原县","沙坡头区","中宁县"]);
this.add("0_19",["海北藏族自治州","西宁","海东地区","西宁","黄南藏族自治州","海南藏族自治州","果洛藏族自治州","玉树藏族自治州","海西蒙古族藏族自治州","海北藏族自治州"]);
this.add("0_19_0",["海北藏族自治州","刚察县","海晏县","门源回族自治县","祁连县"]);
this.add("0_19_1",["西宁","城北区","城东区","城西区","城中区","大通回族土族自治县","湟源县","湟中县","西宁市"]);
this.add("0_19_2",["海东地区","互助土族自治县","化隆回族自治县","乐都县","民和回族土族自治县","平安县","循化撒拉族自治县"]);
this.add("0_19_3",["西宁","城北区","城东区","城西区","城中区","大通回族土族自治县","湟源县","湟中县","西宁市"]);
this.add("0_19_4",["黄南藏族自治州","河南蒙古族自治县","尖扎县","同仁县","泽库县"]);
this.add("0_19_5",["海南藏族自治州","共和县","贵德县","贵南县","同德县","兴海县"]);
this.add("0_19_6",["果洛藏族自治州","班玛县","达日县","甘德县","久治县","玛多县","玛沁县"]);
this.add("0_19_7",["玉树藏族自治州","称多县","囊谦县","曲麻莱县","玉树县","杂多县","治多县"]);
this.add("0_19_8",["海西蒙古族藏族自治州","德令哈市","都兰县","格尔木市","天峻县","乌兰县"]);
this.add("0_19_9",["海北藏族自治州","刚察县","海晏县","门源回族自治县","祁连县"]);
this.add("0_20",["荷泽","济南","青岛","淄博","德州","烟台","潍坊","济宁","泰安","临沂","滨州","东营","威海","枣庄","日照","莱芜","聊城"]);
this.add("0_20_0",["荷泽","曹县","成武县","单县","定陶县","东明县","巨野县","鄄城县","牡丹区","郓城县"]);
this.add("0_20_1",["济南","长清区","槐荫区","济阳县","历城区","历下区","平阴县","商河县","市中区","天桥区","章丘市"]);
this.add("0_20_2",["青岛","城阳区","黄岛区","即墨市","胶南市","胶州市","莱西市","崂山区","李沧区","平度市","市北区","市南区","四方区"]);
this.add("0_20_3",["淄博","博山区","高青县","桓台县","临淄区","沂源县","张店区","周村区","淄川区"]);
this.add("0_20_4",["德州","德城区","乐陵市","临邑县","陵县","宁津县","平原县","齐河县","庆云县","武城县","夏津县","禹城市"]);
this.add("0_20_5",["烟台","长岛县","福山区","海阳市","莱山区","莱阳市","莱州市","龙口市","牟平区","蓬莱市","栖霞市","招远市","芝罘区"]);
this.add("0_20_6",["潍坊","安丘市","昌乐县","昌邑市","坊子区","高密市","寒亭区","奎文区","临朐县","青州市","寿光市","潍城区","诸城市"]);
this.add("0_20_7",["济宁","嘉祥县","金乡县","梁山县","曲阜市","任城区","市中区","泗水县","微山县","汶上县","兖州市","鱼台县","邹城市"]);
this.add("0_20_8",["泰安","岱岳区","东平县","肥城市","宁阳县","泰山区","新泰市"]);
this.add("0_20_9",["临沂","苍山县","费县","河东区","莒南县","兰山区","临沭县","罗庄区","蒙阴县","平邑县","郯城县","沂南县","沂水县"]);
this.add("0_20_10",["滨州","滨城区","博兴县","惠民县","无棣县","阳信县","沾化县","邹平县"]);
this.add("0_20_11",["东营","东营区","广饶县","河口区","垦利县","利津县"]);
this.add("0_20_12",["威海","环翠区","荣成市","乳山市","文登市"]);
this.add("0_20_13",["枣庄","山亭区","市中区","台儿庄区","滕州市","薛城区","峄城区"]);
this.add("0_20_14",["日照","东港区","莒县","岚山区","五莲县"]);
this.add("0_20_15",["莱芜","钢城区","莱城区"]);
this.add("0_20_16",["聊城","茌平县","东阿县","东昌府区","高唐县","冠县","临清市","莘县","阳谷县"]);
this.add("0_21",["朔州","忻州","太原","大同","阳泉","晋中","长治","晋城","临汾","吕梁","运城"]);
this.add("0_21_0",["朔州","怀仁县","平鲁区","山阴县","朔城区","应县","右玉县"]);
this.add("0_21_1",["忻州","保德县","代县","定襄县","繁峙县","河曲县","静乐县","岢岚县","宁武县","偏关县","神池县","五台县","五寨县","忻府区","原平市"]);
this.add("0_21_2",["太原","古交市","尖草坪区","晋源区","娄烦县","清徐县","万柏林区","小店区","杏花岭区","阳曲县","迎泽区"]);
this.add("0_21_3",["大同","城区","大同县","广灵县","浑源县","矿区","灵丘县","南郊区","天镇县","新荣区","阳高县","左云县"]);
this.add("0_21_4",["阳泉","城区","郊区","矿区","平定县","盂县"]);
this.add("0_21_5",["晋中","和顺县","介休市","灵石县","平遥县","祁县","寿阳县","太谷县","昔阳县","榆次区","榆社县","左权县"]);
this.add("0_21_6",["长治","长治县","长子县","城区","壶关县","郊区","黎城县","潞城市","平顺县","沁县","沁源县","屯留县","武乡县","襄垣县"]);
this.add("0_21_7",["晋城","城区","高平市","陵川县","沁水县","阳城县","泽州县"]);
this.add("0_21_8",["临汾","安泽县","大宁县","汾西县","浮山县","古县","洪洞县","侯马市","霍州市","吉县","蒲县","曲沃县","隰县","乡宁县","襄汾县","尧都区","翼城县","永和县"]);
this.add("0_21_9",["吕梁","方山县","汾阳市","交城县","交口县","岚县","离石区","临县","柳林县","石楼县","文水县","孝义市","兴县","中阳县"]);
this.add("0_21_10",["运城","河津市","稷山县","绛县","临猗县","平陆县","芮城县","万荣县","闻喜县","夏县","新绛县","盐湖区","永济市","垣曲县"]);
this.add("0_22",["西安","咸阳","延安","榆林","渭南","商洛","安康","汉中","铜川","铜川"]);
this.add("0_22_0",["西安","灞桥区","碑林区","长安区","高陵县","户县","蓝田县","莲湖区","临潼区","未央区","新城区","阎良区","雁塔区","周至县"]);
this.add("0_22_1",["咸阳","彬县","长武县","淳化县","泾阳县","礼泉县","乾县","秦都区","三原县","渭城区","武功县","兴平市","旬邑县","杨陵区","永寿县"]);
this.add("0_22_2",["延安","安塞县","宝塔区","富县","甘泉县","黄陵县","黄龙县","洛川县","吴旗县","延长县","延川县","宜川县","志丹县","子长县"]);
this.add("0_22_3",["榆林","定边县","府谷县","横山县","佳县","靖边县","米脂县","清涧县","绥德县","吴堡县","榆阳区","子洲县"]);
this.add("0_22_4",["渭南","白水县","澄城县","大荔县","富平县","韩城市","合阳县","华县","华阴市","临渭区","蒲城县","潼关县"]);
this.add("0_22_5",["商洛","丹凤县","洛南县","山阳县","商南县","商州区","神木县","镇安县","柞水县"]);
this.add("0_22_6",["安康","白河县","汉滨区","汉阴县","岚皋县","宁陕县","平利县","石泉县","旬阳县","镇坪县","紫阳县"]);
this.add("0_22_7",["汉中","城固县","佛坪县","汉台区","留坝县","略阳县","勉县","南郑县","宁强县","西乡县","洋县","镇巴县"]);
this.add("0_22_8",["铜川","宝鸡市","陈仓区","凤县","凤翔县","扶风县","金台区","麟游县","陇县","眉县","岐山县","千阳县","太白县","渭滨区","耀州区","宜君县"]);
this.add("0_22_9",["铜川","宝鸡市","陈仓区","凤县","凤翔县","扶风县","金台区","麟游县","陇县","眉县","岐山县","千阳县","太白县","渭滨区","耀州区","宜君县"]);
this.add("0_23",["上海"]);
this.add("0_23_0",["上海","宝山区","长宁区","崇明县","奉贤区","虹口区","黄浦区","嘉定区","金山区","静安区","卢湾区","闵行区","南汇区","浦东新区","普陀区","青浦区","松江区","徐汇区","杨浦区","闸北区"]);
this.add("0_24",["成都","攀枝花","自贡","绵阳","南充","达州","遂宁","广安","巴中","泸州","宜宾","内江","资阳","乐山","眉山","凉山彝族自治州","雅安","甘孜藏族自治州","阿坝藏族羌族自治州","德阳","广元"]);
this.add("0_24_0",["成都","成华区","崇州市","大邑县","都江堰市","金牛区","金堂县","锦江区","龙泉驿区","彭州市","郫县","蒲江县","青白江区","青羊区","邛崃市","双流县","温江县","武侯区","新都区","新津县"]);
this.add("0_24_1",["攀枝花","东区","米易县","仁和区","西区","盐边县"]);
this.add("0_24_2",["自贡","大安区","富顺县","贡井区","荣县","沿滩区","自流井区"]);
this.add("0_24_3",["绵阳","安县","涪城区","江油市","平武县","三台县","盐亭县","游仙区","梓潼县"]);
this.add("0_24_4",["南充","高坪区","嘉陵区","阆中市","南部县","蓬安县","顺庆区","西充县","仪陇县","营山县"]);
this.add("0_24_5",["达州","达县","大竹县","开江县","渠县","通川区","万源市","宣汉县"]);
this.add("0_24_6",["遂宁","安居区","船山区","大英县","蓬溪县","射洪县"]);
this.add("0_24_7",["广安","广安区","华莹市","邻水县","武胜县","岳池县"]);
this.add("0_24_8",["巴中","巴州区","南江县","平昌县","通江县"]);
this.add("0_24_9",["泸州","古蔺县","合江县","江阳区","龙马潭区","泸县","纳溪区","叙永县"]);
this.add("0_24_10",["宜宾","长宁县","翠屏区","高县","珙县","江安县","筠连县","南溪县","屏山县","兴文县","宜宾县"]);
this.add("0_24_11",["内江","东兴区","隆昌县","市中区","威远县","资中县"]);
this.add("0_24_12",["资阳","安岳县","简阳市","乐至县","雁江区"]);
this.add("0_24_13",["乐山","峨边彝族自治县","峨眉山市","夹江县","犍为县","金口河区","井研县","马边彝族自治县","沐川县","沙湾区","市中区","五通桥区"]);
this.add("0_24_14",["眉山","丹棱县","东坡区","洪雅县","彭山县","青神县","仁寿县"]);
this.add("0_24_15",["凉山彝族自治州","布拖县","德昌县","甘洛县","会东县","会理县","金阳县","雷波县","美姑县","冕宁县","木里藏族自治县","宁南县","普格县","西昌市","喜德县","盐源县","越西县","昭觉县"]);
this.add("0_24_16",["雅安","宝兴县","汉源县","芦山县","名山县","石棉县","天全县","荥经县","雨城区"]);
this.add("0_24_17",["甘孜藏族自治州","巴塘县","白玉县","丹巴县","道孚县","稻城县","得荣县","德格县","甘孜县","九龙县","康定县","理塘县","泸定县","炉霍县","色达县","石渠县","乡城县","新龙县","雅江县"]);
this.add("0_24_18",["阿坝藏族羌族自治州","阿坝县","黑水县","红原县","金川县","九寨沟县","理县","马尔康县","茂县","壤塘县","若尔盖县","松潘县","汶川县","小金县"]);
this.add("0_24_19",["德阳","广汉市","旌阳区","罗江县","绵竹市","什邡市","中江县"]);
this.add("0_24_20",["广元","苍溪县","朝天区","剑阁县","青川县","市中区","旺苍县","元坝区"]);
this.add("0_25",["天津"]);
this.add("0_25_0",["天津","宝坻区","北辰区","大港区","东丽区","汉沽区","和平区","河北区","河东区","河西区","红桥区","蓟县","津南区","静海县","南开区","宁河县","塘沽区","武清区","西青区"]);
this.add("0_26",["拉萨","日喀则地区","山南地区","阿里地区","昌都地区","那曲地区"]);
this.add("0_26_0",["拉萨","城关区","达孜县","当雄县","堆龙德庆县","林周县","墨竹工卡县","尼木县","曲水县"]);
this.add("0_26_1",["日喀则地区","昂仁县","白朗县","定结县","定日县","岗巴县","吉隆县","江孜县","康马县","拉孜县","南木林县","聂拉木县","仁布县","日喀则市","萨嘎县","萨迦县","谢通门县","亚东县","仲巴县"]);
this.add("0_26_2",["山南地区","措美县","错那县","贡嘎县","加查县","浪卡子县","隆子县","洛扎县","乃东县","琼结县","曲松县","桑日县","扎囊县"]);
this.add("0_26_3",["阿里地区","波密县","察隅县","措勤县","噶尔县","改则县","革吉县","工布江达县","朗县","林芝地区","林芝县","米林县","墨脱县","普兰县","日土县","札达县"]);
this.add("0_26_4",["昌都地区","八宿县","边坝县","察雅县","昌都县","丁青县","贡觉县","江达县","类乌齐县","洛隆县","芒康县","左贡县"]);
this.add("0_26_5",["那曲地区","安多县","巴青县","班戈县","比如县","嘉黎县","那曲县","尼玛县","聂荣县","申扎县","索县"]);
this.add("0_27",["塔城地区","哈密地区","和田地区","阿勒泰地区","克孜勒苏柯尔克孜自治州","博尔塔拉蒙古自治州","克拉玛依","塔城地区","乌鲁木齐","塔城地区","伊犁哈萨克自治州","省直辖行政单位","塔城地区","昌吉回族自治州","省直辖行政单位","吐鲁番地区","巴音郭楞蒙古自治州","阿克苏地区","克孜勒苏柯尔克孜自治州","省直辖行政单位","喀什地区","省直辖行政单位","伊犁哈萨克自治州"]);
this.add("0_27_0",["塔城地区","额敏县","和布克赛尔蒙古自治县","沙湾县","塔城市","托里县","乌苏市","裕民县"]);
this.add("0_27_1",["哈密地区","巴里坤哈萨克自治县","哈密市","伊吾县"]);
this.add("0_27_2",["和田地区","策勒县","和田市","和田县","洛浦县","民丰县","墨玉县","皮山县","于田县"]);
this.add("0_27_3",["阿勒泰地区","阿勒泰市","布尔津县","福海县","富蕴县","哈巴河县","吉木乃县","青河县"]);
this.add("0_27_4",["克孜勒苏柯尔克孜自治州","阿合奇县","阿克陶县","阿图什市","乌恰县"]);
this.add("0_27_5",["博尔塔拉蒙古自治州","博乐市","精河县","温泉县"]);
this.add("0_27_6",["克拉玛依","白碱滩区","独山子区","克拉玛依区","乌尔禾区"]);
this.add("0_27_7",["塔城地区","额敏县","和布克赛尔蒙古自治县","沙湾县","塔城市","托里县","乌苏市","裕民县"]);
this.add("0_27_8",["乌鲁木齐","东山区","沙依巴克区","水磨沟区","天山区","头屯河区","乌鲁木齐县","新市区"]);
this.add("0_27_9",["塔城地区","额敏县","和布克赛尔蒙古自治县","沙湾县","塔城市","托里县","乌苏市","裕民县"]);
this.add("0_27_10",["伊犁哈萨克自治州","察布查尔锡伯自治县","巩留县","霍城县","奎屯市","尼勒克县","特克斯县","新源县","伊宁市","伊宁县","昭苏县"]);
this.add("0_27_11",["省直辖行政单位","阿拉尔市","潜江市","神农架林区","石河子市","天门市","图木舒克市","五家渠市","仙桃市"]);
this.add("0_27_12",["塔城地区","额敏县","和布克赛尔蒙古自治县","沙湾县","塔城市","托里县","乌苏市","裕民县"]);
this.add("0_27_13",["昌吉回族自治州","昌吉市","阜康市","呼图壁县","吉木萨尔县","玛纳斯县","米泉市","木垒哈萨克自治县","奇台县"]);
this.add("0_27_14",["省直辖行政单位","阿拉尔市","潜江市","神农架林区","石河子市","天门市","图木舒克市","五家渠市","仙桃市"]);
this.add("0_27_15",["吐鲁番地区","鄯善县","吐鲁番市","托克逊县"]);
this.add("0_27_16",["巴音郭楞蒙古自治州","博湖县","和静县","和硕县","库尔勒市","轮台县","且末县","若羌县","尉犁县","焉耆回族自治县"]);
this.add("0_27_17",["阿克苏地区","阿克苏市","阿瓦提县","拜城县","柯坪县","库车县","沙雅县","温宿县","乌什县","新和县"]);
this.add("0_27_18",["克孜勒苏柯尔克孜自治州","阿合奇县","阿克陶县","阿图什市","乌恰县"]);
this.add("0_27_19",["省直辖行政单位","阿拉尔市","潜江市","神农架林区","石河子市","天门市","图木舒克市","五家渠市","仙桃市"]);
this.add("0_27_20",["喀什地区","巴楚县","伽师县","喀什市","麦盖提县","莎车县","疏附县","疏勒县","塔什库尔干塔吉克自治县","叶城县","英吉沙县","岳普湖县","泽普县"]);
this.add("0_27_21",["省直辖行政单位","阿拉尔市","潜江市","神农架林区","石河子市","天门市","图木舒克市","五家渠市","仙桃市"]);
this.add("0_27_22",["伊犁哈萨克自治州","察布查尔锡伯自治县","巩留县","霍城县","奎屯市","尼勒克县","特克斯县","新源县","伊宁市","伊宁县","昭苏县"]);
this.add("0_28",["西双版纳傣族自治州","德宏傣族景颇族自治州","昭通","昆明","大理白族自治州","红河哈尼族彝族自治州","曲靖","保山","文山壮族苗族自治州","玉溪","楚雄彝族自治州","思茅","临沧","怒江傈僳族自治州","迪庆藏族自治州","丽江"]);
this.add("0_28_0",["西双版纳傣族自治州","景洪市","勐海县","勐腊县"]);
this.add("0_28_1",["德宏傣族景颇族自治州","梁河县","陇川县","潞西市","瑞丽市","盈江县"]);
this.add("0_28_2",["昭通","大关县","鲁甸县","巧家县","水富县","绥江县","威信县","盐津县","彝良县","永善县","昭阳区","镇雄县"]);
this.add("0_28_3",["昆明","安宁市","呈贡县","东川区","富民县","官渡区","晋宁县","禄劝彝族苗族自治县","盘龙区","石林彝族自治县","嵩明县","五华区","西山区","寻甸回族彝族自治县","宜良县"]);
this.add("0_28_4",["大理白族自治州","宾川县","大理市","洱源县","鹤庆县","剑川县","弥渡县","南涧彝族自治县","巍山彝族回族自治县","祥云县","漾濞彝族自治县","永平县","云龙县"]);
this.add("0_28_5",["红河哈尼族彝族自治州","个旧市","河口瑶族自治县","红河县","建水县","金平苗族瑶族傣族自治县","开远市","泸西县","绿春县","蒙自县","弥勒县","屏边苗族自治县","石屏县","元阳县"]);
this.add("0_28_6",["曲靖","富源县","会泽县","陆良县","罗平县","马龙县","麒麟区","师宗县","宣威市","沾益县"]);
this.add("0_28_7",["保山","昌宁县","龙陵县","隆阳区","施甸县","腾冲县"]);
this.add("0_28_8",["文山壮族苗族自治州","富宁县","广南县","麻栗坡县","马关县","丘北县","文山县","西畴县","砚山县"]);
this.add("0_28_9",["玉溪","澄江县","峨山彝族自治县","红塔区","华宁县","江川县","通海县","新平彝族傣族自治县","易门县","元江哈尼族彝族傣族自治县"]);
this.add("0_28_10",["楚雄彝族自治州","楚雄市","大姚县","禄丰县","牟定县","南华县","双柏县","武定县","姚安县","永仁县","元谋县"]);
this.add("0_28_11",["思茅","翠云区","江城哈尼族彝族自治县","景东彝族自治县","景谷傣族彝族自治县","澜沧拉祜族自治县","孟连傣族拉祜族佤族自治县","墨江哈尼族自治县","普洱哈尼族彝族自治县","西盟佤族自治县","镇沅彝族哈尼族拉祜族自治县"]);
this.add("0_28_12",["临沧","沧源佤族自治县","凤庆县","耿马傣族佤族自治县","临翔区","双江拉祜族佤族布朗族傣族自治县","永德县","云县","镇康县"]);
this.add("0_28_13",["怒江傈僳族自治州","福贡县","贡山独龙族怒族自治县","兰坪白族普米族自治县","泸水县"]);
this.add("0_28_14",["迪庆藏族自治州","德钦县","维西傈僳族自治县","香格里拉县"]);
this.add("0_28_15",["丽江","古城区","华坪县","宁蒗彝族自治县","永胜县","玉龙纳西族自治县"]);
this.add("0_29",["衢州","杭州","湖州","嘉兴","宁波","绍兴","台州","温州","丽水","金华","舟山"]);
this.add("0_29_0",["衢州","常山县","江山市","开化县","柯城区","龙游县","衢江区"]);
this.add("0_29_1",["杭州","滨江区","淳安县","富阳市","拱墅区","建德市","江干区","临安市","上城区","桐庐县","西湖区","下城区","萧山区","余杭区"]);
this.add("0_29_2",["湖州","安吉县","长兴县","德清县","南浔区","吴兴区"]);
this.add("0_29_3",["嘉兴","海宁市","海盐县","嘉善县","平湖市","桐乡市","秀城区"]);
this.add("0_29_4",["宁波","北仑区","慈溪市","奉化市","海曙区","江北区","江东区","宁海县","象山县","鄞州区","余姚市","镇海区"]);
this.add("0_29_5",["绍兴","上虞市","绍兴县","嵊州市","新昌县","越城区","诸暨市"]);
this.add("0_29_6",["台州","黄岩区","椒江区","临海市","路桥区","三门县","天台县","温岭市","仙居县","玉环县"]);
this.add("0_29_7",["温州","苍南县","洞头县","乐清市","龙湾区","鹿城区","瓯海区","平阳县","瑞安市","泰顺县","文成县","永嘉县"]);
this.add("0_29_8",["丽水","缙云县","景宁畲族自治县","莲都区","龙泉市","青田县","庆元县","松阳县","遂昌县","云和县"]);
this.add("0_29_9",["金华","东阳市","金东区","兰溪市","磐安县","浦江县","武义县","婺城区","义乌市","永康市"]);
this.add("0_29_10",["舟山","岱山县","定海区","普陀区","嵊泗县"]);
this.add("0_30",["重庆"]);
this.add("0_30_0",["重庆","巴南区","北碚区","璧山县","长寿区","城口县","大渡口区","大足县","垫江县","丰都县","奉节县","涪陵区","合川市","江北区","江津市","九龙坡区","开县","梁平县","南岸区","南川市","彭水苗族土家族自治县","綦江县","黔江区","荣昌县","沙坪坝区","石柱土家族自治县","双桥区","铜梁县","潼南县","万盛区","万州区","巫山县","巫溪县","武隆县","秀山土家族苗族自治县","永川市","酉阳土家族苗族自治县","渝北区","渝中区","云阳县","忠县"]);
this.setup();
}